remote-results/confluence/confluence/2021-04-23_03-07-46/merged.yml
---
execution:
- concurrency: ${concurrency}
  executor: ${load_executor}
  hold-for: ${test_duration}
  ramp-up: ${ramp-up}
  scenario: ${load_executor}
- executor: selenium
  hold-for: ${test_duration}
  runner: pytest
  scenario: selenium
modules:
  consolidator:
    percentiles: []
    rtimes-len: 0
  jmeter:
    detect-plugins: true
    memory-xmx: 8G
    plugins:
    - bzm-parallel=0.4
    - bzm-random-csv=0.6
    - jpgc-casutg=2.5
    - jpgc-dummy=0.2
    - jpgc-ffw=2.0
    - jpgc-fifo=0.2
    - jpgc-functions=2.1
    - jpgc-json=2.6
    - jpgc-perfmon=2.1
    - jpgc-prmctl=0.4
    - jpgc-tst=2.4
    - jpgc-wsc=0.3
    - tilln-sshmon=1.0
    - jpgc-synthesis=2.2
    system-properties:
      httpsampler.ignore_failed_embedded_resources: 'true'
      java.rmi.server.hostname: localhost
      server.rmi.ssl.disable: true
    version: ${JMETER_VERSION}
  selenium:
    chromedriver:
      version: 89.0.4389.23
reporting:
- data-source: sample-labels
  module: junit-xml
scenarios:
  jmeter:
    properties:
      application_hostname: ${application_hostname}
      application_port: ${application_port}
      application_postfix: ${application_postfix}
      application_protocol: ${application_protocol}
      perc_comment_page: ${comment_page}
      perc_create_and_edit_page: ${create_and_edit_page}
      perc_create_blog: ${create_blog}
      perc_like_page: ${like_page}
      perc_search_cql: ${search_cql}
      perc_standalone_extension: ${standalone_extension}
      perc_upload_attachment: ${upload_attachment}
      perc_view_attachment: ${view_attachment}
      perc_view_blog: ${view_blog}
      perc_view_dashboard: ${view_dashboard}
      perc_view_page: ${view_page}
      total_actions_per_hr: ${total_actions_per_hour}
    script: jmeter/confluence.jmx
  locust:
    script: locustio/confluence/locustfile.py
  selenium:
    script: selenium_ui/confluence_ui.py
services:
- module: shellexec
  post-process:
  - python util/analytics/analytics.py confluence
  - python util/post_run/cleanup_results_dir.py
  prepare:
  - python util/pre_run/environment_checker.py
  - python util/data_preparation/confluence_prepare_data.py
  shutdown:
  - python util/post_run/jmeter_post_check.py
  - python util/jtl_convertor/jtls-to-csv.py kpi.jtl selenium.jtl
settings:
  aggregator: consolidator
  artifacts-dir: results/confluence/%Y-%m-%d_%H-%M-%S
  env:
    JMETER_VERSION: 5.4.1
    LANGUAGE: en_US.utf8
    WEBDRIVER_VISIBLE: false
    admin_login: admin
    admin_password: '********'
    allow_analytics: true
    application_hostname: confs-loadb-1bytspbypdfbc-1945029135.us-west-2.elb.amazonaws.com
    application_port: 80
    application_postfix: null
    application_protocol: http
    comment_page: 5
    concurrency: 200
    create_and_edit_page: 6
    create_blog: 3
    custom_dataset_query: null
    like_page: 3
    load_executor: jmeter
    ramp-up: 5m
    search_cql: 7
    secure: true
    standalone_extension: 0
    test_duration: 45m
    total_actions_per_hour: 20000
    upload_attachment: 5
    view_attachment: 3
    view_blog: 8
    view_dashboard: 6
    view_page: 54
  verbose: false